Repository: mozilla-l10n/mt-training-data
Catalog: azz/azz_pontoon.tmx
Source language: en_us
Languages: azz

source: { -brand-name } apps and services
azz: Tekimej aplicaciones uan tapaleuilmej tein kitemaka { -brand-name }

source: { -brand-name } Browser for Desktop
azz: { -brand-name } Navegador tein tajkuiloluapal escritorio

source: { -brand-name } Browser for Mobile
azz: Navegador { -brand-name } itech teposuejkatanojnotsalonimej celulares

source: { -brand-name } is tech that fights for your online privacy.
azz: { -brand-name } yejua tepos tecnología tein motelchikaua uan ijkon Internetkopa kiyekpias tein moaxka

source: Breach date:
azz: Tapoual keman aksa kinekik ichtakakalak:

source: Close menu
azz: Maj motsakua menú kampa se taixpejpena

source: Could not add email address to database.
azz: Amo uelik moajxitilij in correo electrónico itech base tein datos.

source: Could not load breaches.
azz: Amo uelik monextij keman oksekin ichtakakalakisnekkej.

source: Download { -brand-name }
azz: Xiktemoui { -brand-name }

source: Enter Email Address
azz: Xikijkuilo mocorreo itech tepos

source: Error
azz: Nepolol

source: Error connecting to { -brand-HIBP }.
azz: Amo uelik monajnamiktij itech { -brand-HIBP }.

source: Firefox account
azz: Cuenta Firefox

source: Firefox Account
azz: Cuenta itech Firefox

source: Invalid Email
azz: Amo kualtia nejin correo itech tepos

source: Invalid session
azz: Amo kualtia sesión

source: Made by { -brand-Mozilla }
azz: Kichijchiuak { -brand-Mozilla }

source: Must be a valid email
azz: Xikijkuilo se correo tein yekmelauj kualtia

source: Must be a valid email.
azz: Moneki se correo tein kualtia.

source: Page not found.
azz: Amo kiajsik página.

source: { -product-name } : Scan Results
azz: { -product-name } : Keniuj kisak tein kiijitak

source: { -product-name } : Unsubscribe
azz: { -product-name } : Maj amo nimoyekijkuilojto ya

source: Search Your Email
azz: Xiktemo mocorreo

source: Sent!
azz: ¡Motitanik ya!

source: Sign Up
azz: Xikchiua mocuenta

source: Stronger Passwords = Better Protection
azz: Okachi chikauak moichtakatajtol = okachi kuali timonejmachpias

source: Terms & Privacy
azz: Keniuj motekiltis uan Keniuj tiyekpiaj tein tikseliaj

source: This email address is not subscribed to { -product-name }.
azz: Nejin correo itech tepos amo moijkuiloj itech { -product-name }.

source: This email has already been added to { -product-name }.
azz: Nejin correo itech tepos moajxitilij ya itech { -product-name }.

source: This will remove your email from the { -product-name-nowrap } list and you will no longer receive alerts when new breaches are announced.
azz: Nejin kiajchiuas mocorreo kampa moijkuilojtinemij itech { -product-name-nowrap } uan amo mitsnauatis keman oksekin kinekiskej ichtakakalakiskej.

source: To finish verifying this email for { -product-name }, you must be signed in under your primary account email.
azz: Moneki tikalakteuas itech mocuenta tein ika mocorreo tein tayekantok, uan ijkon tiktamiyekitas nejin correo itech { -product-name }.

source: Too many connections to { -brand-HIBP }.
azz: Telsenka monajnamiktijtokej itech { -brand-HIBP }.

source: Unsubscribe from { -product-name-nowrap }
azz: Maj amo nimoyekijkuiloto ya itech { -product-name-nowrap }

source: Unsubscribing requires a token.
azz: Komo tikneki amo timoyekijkuilojtos ya, moneki se token.

source: Unsubscribing requires a token and emailHash.
azz: Komo tikneki amo timoyekijkuilojtos ya, moneki se token uan emailHash.

source: Verification token is required.
azz: Moneki se token tein ika se kiyekitas tensa.

source: Verify your subscription to { -product-name }.
azz: Xikyekita komojkon timoyekijkuiloj itech { -product-name }.

source: Visit your { $preferencesLink } to check the status of { $userEmail }.
azz: Xikita { $preferencesLink } tein tikpia uan ijkon tikyekitas keniuj moajsi { $userEmail }.

source: You are monitoring the maximum number of email addresses.
azz: Tikitstok ya nochi correos itech tepos tein se uelis kiitas ika monitor.

source: You must be signed in to your { -brand-fxa }.
azz: Moneki tikalakteuas itech { -brand-fxa } tein tikpia.

source: Your { -product-name } report
azz: Tanauatil tein mitsiluia keniuj moajsi { -product-name }

source: Your right to be safe from hackers starts here.
azz: Nikan peua timopaleuia tachtekinij hackers.

source: You tried to scan too many email addresses in a short time period. For security reasons, we’ve temporarily blocked you from new searches. You’ll be able to try again later.
azz: Yeknenken tikuitoya tel miak correos itech tepos. Kemej yon tamouilil, yekintsin tiktsakuilijkej nochi tein tiktemojtoya. Satepan uelis oksepa tikchiuas.

source: 404: Page Not Found
azz: 404: Amo kiajsik página

source: <abbr>Apr</abbr>
azz: <abbr>Abr</abbr>

source: <abbr>Aug</abbr>
azz: <abbr>Agos</abbr>

source: <abbr>Dec</abbr>
azz: <abbr>Dic</abbr>

source: <abbr>Jan</abbr>
azz: <abbr>Ene</abbr>

source: About
azz: Okachi xionmomachti

source: About Mozilla
azz: Xikonixmati Mozilla

source: About Us
azz: Tiakonimej

source: A browser on a mission
azz: Se navegador tein kipia itekiuj

source: Accessible
azz: Amo ouij se kiajsis

source: Adblock, Ublock, LastPass and thousands more.
azz: Adblock, Ublock, LastPass uan oksekin okachi tel miakej.

source: Add, modify and remove cache, cookies, databases and session data.
azz: Xikontali, xikonpata uan xikonajchiua caché, cookies, bases tein datos uan nochi tein moijkuiloj keman sesión.

source: Add-ons
azz: Tamajsikayomej

source: Ad tracker blocking
azz: Maj moajchiuakan tanauatilmej tein tetoktiliaj

source: <a href="%(url)s">Chrome uses up to 1.77x more memory than Firefox</a>. If your computer is already low on memory, this can cause a significant slowdown. Using Firefox’s latest version with multi-process can result in more available memory to run your favorite programs.
azz: <a href="%(url)s"> Chrome kikui kemej 1.77 okachi taelnamikilis uan amo Firefox </a>. Komo motepos kipia ya amo miak taelnamikilis, nejon uelis kichiuas maj yolik tekiti. Komo tikontatekiujtis Firefox tein yankuik uan ika tekiti tel miak ojtokaltilismej, uelis mokauas taelnamikilis tein tionuelis tikonkuis ika programas tein tikonteluelitstinemi.

source: <a href="%(url)s">Update</a> your Firefox for the latest in speed and privacy.
azz: <a href="%(url)s">Xikonyankuili</a> moFirefox uan ijkon okachi kualiok kiyekpias tein kiselis uan okachi isiujkaok tekitis.

source: All Languages and Builds
azz: Nochin tepostajtolis uan compilaciones

source: All Languages and Builds (incl. Win 64)
azz: Nochin tepostajtolis uan compilaciones (no Win 64)

source: Already using Firefox?
azz: ¿Tikontatekiujtijtokya Firefox?

source: Android Add-ons
azz: Tamajsikayomej ika Android

source: Android Browser
azz: Navegador tein Android

source: Android Support
azz: Nepaleuilis ika Android

source: Apps
azz: Aplicaciones

source: April
azz: Metsti abril

source: <a rel="external" href="%(feedback)s">Give us feedback</a> to help us put the final tweaks on performance and functionality in a stable environment.
azz: <a rel="external" href="%(feedback)s">Xitechonpanoltili motanemililuan</a> maj titechonpaleui tiktamiyektaliskej keniuj taki totachiualisuan uan nepaleuilmej kampa amo mopatatok.

source: August
azz: Metsti agosto

source: Available Languages
azz: Tajtolismej tein se uelis kiixpejpenas

source: Back to home page
azz: Maj se kikuepa página kampa peua

source: Balanced memory usage
azz: Kitekitiltia taelnamikilis kemej moneki

source: Be among the first to explore future releases of Firefox for desktop, Android and iOS.
azz: Xionmoachtoui uan xikontatekiujti versiones Firefox tein satepan ualas ika tepos tein tajkuiloluapal, Android uan iOS.

source: Become a volunteer contributor in a number of different areas.
azz: Xionmochiua se akin kipaleuia itech miak taman.

source: Beta, Nightly, Developer Edition
azz: Beta uan Nightly, manamik Edición tein uelis kikuiskej akin webchijchiuianij

source: Better bookmarks
azz: Neskayomej marcadores itech Internet tein okachi kuali

source: Block ad trackers
azz: Maj moajchiuakan tanauatilmej tein tetoktiliaj

source: Blog
azz: Tepostanojnots blog

source: Bring it, Internet! We’ve spent the last year supercharging Firefox’s performance. Now start up faster, tab hop quicker and scroll like a speed demon.
azz: ¡Xikajsi Internet! Titekitikej se xiuit uan tiuelinij tikchiuaskej ke Firefox okachi kuali kichiua tensa. Axkan okachi ijsiujka moxotaltia, okachi ijsiujka moixpataj pestañas uan moolinia ijsiujka kemej se amokuali ejekat.

source: Bring your Firefox bookmarks, tabs, or passwords wherever you go with Firefox Sync. Share between computers and mobile devices. Get Firefox now!
azz: Kampa yeski xikontatekiujti moneskayouan marcadores, pestañas oso ichtakatajkuilolmej tein tikonpia Firefox ika nepaleuil Firefox Sync. Maj mitsonsentekitilikan teposmej tein tajkuiloluapal oso teposmej tein tikonuikas okseko. ¡Axkan xikonajsi Firefox!

source: Browse faster
azz: Xikontatekiujti Internet okachi ijsiujka

source: Browse faster, privately
azz: Okachi ijsiujka xikontatekiujti Internet, uan kuali kiyekpiaskej tein kiseliskej

source: Browse freely.
azz: Xikontatekiujtis Internet uan amo xionmomachili tiilpitok

source: Browse independently with Firefox
azz: Xikonixyekana keniuj tikontatekiujtia Internet ika Firefox

source: Browse smoothly and leave plenty of memory for your computer programs.
azz: Amo ouij xikontatekiujti Internet uan xikonkaua tel miak taelnamikilis tein uelis kikuis programas tein moajsij itech motepos.

source: Browse the Internet as it was meant to be… free, safe and accessible to all. Declare your online independence.
azz: Xikontatekiujti Internet kemej monekiskia… tatojtomal, yekyetok uan nochimej maj amo ouij ueli kalakiskej. Xikonnexti Internetkopa amo tikontamakati akin okachi uejueyichiuanimej.

source: Browse without a trace
azz: Xikontatekiujti Internet uan amo xikonkaua motaksalis tein uelis kitojtiliskej

source: Build, test, scale and more with the only browser built just for developers.
azz: Xiontachijchiua, xiontaixejeko uan xiontaiskalti uan okachiok, tein ika sesaj navegador tein aksamej kinchiuilijkej webchijchiuanij.

source: Built for those who build the Web. The only browser made for developers like you.
azz: Tikinchijchiuilijkej akonimej kichijchiujtijtinemij web. Yejua sesaj navegador tein aksamej kinchiuilijkej webchijchiuanij kemej tejuatsin.

source: By non-profit, Mozilla
azz: Tein amo kitemoua motomintis, Mozilla

source: Careers
azz: Tekimej

source: Catch those hidden trackers
azz: Xikonkitski tein teichtakatoktiliaj

source: Catch up on your open tabs and saved reads over Saturday morning coffee. Find your bookmarks and passwords anywhere you use Firefox—your smartphone, tablet or laptop. Connect everything you need and nothing you don’t.
azz: Tonal sábado kualkan tiontayi mokajfentsin, xikonsentoka ika mopestañajuan tatapotokej uan tein ika achto tikonixtajtoltiaya. Xikonajsi moneskayomej marcadores uan moichtakatajkuiloluan kampa yeski tikontatekiujtis Firefox, kemej moteléfono, motableta oso motepos. Xikonnajnamikti sayoj nochi tein moneki san.

source: Chart your own course
azz: Xikonixtali moojpan saj

source: Check out new Android features in their earliest stages. Enjoy at your own risk.
azz: Xiontachiati yankuikej nepaleuilmej ika Android ijkuak peua. Xionixmatati uan xionmopakilti.

source: Choose independence
azz: Xikonixpejpena tionmoixyekanas

source: Choose the independent browser
azz: Xikonixpejpena navegador tein amo akin kiixyekana

source: Click the download button on the right to continue.
azz: Xikonpatskili botón Xikontemoui yekmakopa uan tionuelis tikonsentokas

source: Close
azz: Maj motsakua

source: Committed to you, your privacy and an open Web
azz: Timoyektajtoltenkauaj mouan, tikyekpias tein titechonseliltis uan ika red tatojtomal

source: Congrats. You’re up to date!
azz: Xionyolpaki. ¡Tionmoyankuilijya!

source: Congrats! You’re using the latest version of Firefox.
azz: ¡Xionyolpaki! Tikontatekiujtijtok okachi yankuik versión Firefox.

source: Console
azz: Consola

source: Contact Us
azz: Kampa se uelis techijkuilouilis

source: Continue to mozilla.org
azz: Xionkalaki mozilla.org

source: Contribute to this page
azz: Xiontapaleui itech nejin página

source: Contribute to this site
azz: Nikan xiontapaleui

source: Customize
azz: Xikonchijchiua kemej tikonkuisneki

source: Customize with Add-ons
azz: Xikonchijchiua kemej tikonkuisneki ika tamajsikayomej

source: Customize your bookmarks
azz: Xikonyekchiua moneskayouan marcadores kemej tikonkuisnekis

source: Customize your browser
azz: Xikonyekchiua monavegador kemej tikonkuisnekis

source: Debugger
azz: Tachipaualoni

source: December
azz: Metsti diciembre

source: Desktop
azz: Tajkuiloluapal

source: Desktop Add-ons
azz: Tamajsikayomej tein ika se kikuis se itepos tein se itajkuiloluapal

source: Desktop Browser
azz: Navegador tein tajkuiloluapal

source: Desktop Browser for Mac, Windows, Linux
azz: Navegador tein takuiloluapal ika Mac, Windows uan Linux

source: Desktop Support
azz: Nepaleuilis ika tajkuilouapal

source: Developer Edition
azz: Edición tein uelis kikuiskej webchijchiuanij

source: Did you know? Mozilla — the maker of Firefox — fights to keep the Internet a global public resource, open and accessible to all.
azz: ¿Tikonmattok? Mozilla — akin kichijchiuak Firefox — mochikaua nochin uelis kitatekiujtis Internet semanauak taltikpakI, Internet yeski tatapotok uan nion se kitsakuiliskej kikuis.

source: Did you make a left at that last URL instead of a right? No problem. Here are some tips to get you back on your way:
azz: ¿Xa tikonpia URL moopochmakopa uan amo moyekmakopa? Amo teyi kuejmol. Nikan moajsij tajtolmakalismej maj tionmokepa moojpan:

source: Discover unlimited potential, endless possibility and a wide open Web.
azz: Xikonajsi tionuelis tikonchiuas nochi tein tikonnekis, tachiualismej tein amo keman tamij uan no se ueyi web tein tatapotok.

source: Do more with Firefox
azz: Okachi xikonchiua tensa ika Firefox

source: Donate
azz: Maj se kipaleui ika tomin

source: Donate Now
azz: Axkan xitechonpaleui ika tomin

source: Don’t agonize, lovers of bookmarking. Organize with Firefox.
azz: Tejuatsin tikontasojta neskayomej marcadores, amo xiontajyoui. Xikonojtokalti ika Firefox

source: Download
azz: Xikontemoui

source: Download and test future releases of Firefox for desktop, Android and iOS.
azz: Xikontemoui uan xikonixejeko oksekin versiones Firefox tein satepan ualaskej ika tajkuiloluapal, Android uan iOS.

source: Download and test the latest Firefox for Android features with Aurora, Beta and Nightly builds.
azz: Xikontemoui uan xikonixejeko inepaleuiluan Firefox tein okachi yankuikej ika Android tein kipia Aurora, Beta uan Nightly.

source: Download and test the latest Firefox for desktop features with Developer Edition, Beta and Nightly builds.
azz: Xikontemoui uan xikonixejeko inepaleuiluan Firefox tein tajkuiloluapal ika Developer Edition, Beta uan Nightly.

source: Download Firefox for Android and iOS
azz: Xikontemoui Firefox ika Android uan iOS

source: Download Firefox for your smartphone and tablet.
azz: Xikontemoui Firefox tein tionuelis tikonkuis ika mosmartphone uan motableta.

source: Download Firefox <span>for Linux</span>
azz: Xikontemoui Firefox <span>tein kualtia Linux</span>

source: Download Firefox <span>for macOS</span>
azz: Xikontemoui Firefox <span>tein kualtia macOS</span>

source: Download Firefox <span>for Windows</span>
azz: Xikontemoui Firefox <span>tein kualtia Windows</span>

source: Download Firefox Web Browser
azz: Navegador tein web Mozilla Firefox

source: Download Mozilla Firefox, a free Web browser. Firefox is created by a global non-profit dedicated to putting individuals in control online. Get Firefox for Windows, macOS, Linux, Android and iOS today!
azz: Xikontemoui Mozilla Firefox, se navegador web tein amo se moneki kiixtauas. Firefox kichijchiujkej se nechikol semanauak taltikpak tein amo kitemouaj motomintiskej ta kinpaleuiskej taltikpakneminij maj kiixyekantinemij keniuj kitatekiujtiaj Internet. ¡Xikonpia axkan Firerfox tein tionuelis tikonkuis ika Windows, macOS, Linux, Android uan iOS!

source: Earn your second security black belt with Firefox’s vast array of password manager <a href="%(addons)s">add-ons</a>. Choose an existing favorite or find a next-level one through expert community ratings and reviews.
azz: Xikontani okse motiltiktajkoilpiloni tein mouika iuan yekyetolis itechkopa miakej <a href="%(addons)s"> tamajsikayomej </a> kampa se uelis kiyekanas ichtakatajkuilolmej. Xikonixpejpena se tein xikonteluelita oso xikonajsi se yankuik itechkopa ratings uan tein kinemiliaj tokniuan.

source: Earn your second security black belt with Firefox’s vast array of password manager <a href="%(addons)s">add-ons</a>. Go with a favorite like <a href="%(lastpass)s">LastPass</a>, or reach password manager mastery with ratings and community reviews.
azz: Xikontani okse motiltiktajkoilpiloni tein mouika iuan yekyetolis itechkopa miakej <a href="%(addons)s"> tamajsikayomej </a> kampa se uelis kiyekanas ichtakatajkuilolmejej tein kipia Firefox. Xikontatekiujti se tein nochi kiteluelitaj, kemej neskayot <a href="%(lastpass)s"> LastPass</a>, oso xionmokuepa xitamachtijkej akin semi tikonixmattos tikonyekanas ichtakatajuilolmej itechkopa ratings uan tein kinemiliaj tokniuan.

source: Easily manage your logins
azz: Amo ouij xikonyekana kampa tionkalakteua

source: Easily organize your bookmarks into folder and access them across all your devices, from desktop to mobile.
azz: Xikonixtali kemej kuali moajsij moneskayouan marcadores ika carpetas uan itech xionkalaki ika nochin moteposuan, kemej tein tajkuilouapal oso tein se uelis mouikas.

source: Edit and manage all your CSS stylesheets in your browser.
azz: Xikontapoua uan xikonpata uan xikonixyekana nochin moamauan tein estilo CSS itech monavegador.

source: Edit, write, run and execute JavaScript in real time.
azz: Xikontapoua uan xikonpata uan xikonpeualti JavaScript itech tonal tein yekmelauj.

source: Email
azz: Correo itech tepos

source: Enter your own amount
azz: Xikonijkuilo tapoual tein moaxka

source: Every computer program you run takes up some memory. When too much is used, your system can slooooowww down. Firefox aims for a balance — using enough memory to let you browse smoothly and leaving plenty of memory to keep your computer responsive.
azz: Sejsemej programas tein moajsi itech computadora keman tekiti kikui tepitsin taelnamikilis. Komo tel miak kikuij, mosistema uelis tiuiiiiiixtiiiias. Firefox tekiti keniuj moneki — kikui taelnamikilis tein ajsi uan ijkon tionuelis tikontatekiujtis Internet amo ika kuejmolmej, uan tikonkauas tel miak taelnamikilis tein ika motepos uelis tekitis.

source: Except where otherwise <a href="%s">noted</a>, content on this site is licensed under the <br /><a href="%s">Creative Commons Attribution Share-Alike License v3.0</a> or any later version.
azz: Komo <a href="%s">amo tensa</a> motanejmachtia, tein kipia nejin sitio web iaxka <br /><a href="%s">Creative Commons Attribution Share-Alike License v3.0</a> oso okse versión tein kisentokak.

source: Experience cutting-edge browser features in pre-release versions: Firefox Developer Edition, Firefox Beta and Firefox Nightly. Download now!
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia navegador tein ika versiones acho release: Firefox Developer Edition, Firefox Beta uan Firefox Nightly. ¡Axkan xikontemoui!

source: Experience cutting-edge features in a pre-release browser for Android: Firefox Beta and Firefox Nightly. Install now!
azz: Xikonixejeko yankuikej nepaleuilmej tein kipia se navegador achto ke nochin uelis kitatekiujtis, ika Android: Firefox tein Beta uan Firefox Nightly. ¡Axkan xikontalili motepos!

source: Experience cutting-edge features in a pre-release browser for Android: Firefox Beta, Firefox Aurora and Firefox Nightly. Install now!
azz: Xikonixejeko yankuikej nepaleuilmej tein kipia se navegador achto ke nochin uelis kitatekiujtis, ika Android: Firefox Beta, Firefox Aurora uan Firefox Nightly. ¡Axkan xikontalili motepos!

source: Experience cutting-edge features in a pre-release browser for iOS via Apple’s TestFlight program. Install now!
azz: Xikonixejeko yankuikej nepaleuilmej tein kipia se navegador achto ke nochin uelis kitatekiujtis, ika iOS itechkopa programa TestFlight tein kichiuak Apple. ¡Axkan xikontalili motepos!

source: Experimental features that can simplify your life.
azz: Nepaleuilmej tein kiixejekojtokej tein uelis kichiuaskej okachi amo ouij monemilis.

source: Explore the web faster with <a href="%(url)s">Firefox Private Browsing</a>. Only Firefox’s private mode includes tracking protection which blocks ads with trackers from loading on pages. Decluttering sites means web pages can load faster.
azz: Okachi ijsiujka xikonita Web ika nepaleuil <a href="%(url)s">Maj se kitatekiujti Internet uan amo se mokuejmolo</a> tein kipia Firefox. Sayoj nejin inepaleuil Firefox amo kikaua maj tetoktilikan uan kiajchiua tanauatilmej tein tetoktiliaj tein moajsij itech sitios web. Se kiyektejtekpanas sitios kiijtosneki páginas web tein okachi ijsiujka monextijkej.

source: Features
azz: Nepaleuilmej

source: February
azz: Metsti febrero

source: Feedback makes us better. Tell us how we can improve the browser and Developer tools.
azz: Ika tanemililmej tein tokniuan techteixmatiltiaj uelis tiyektachijchiuaskej. Xikonili keniuj uelis tikyekchijchiuaskej navegador uan manamikmej tein kitatekiujtiaj webchijchiuanij.

source: File a bug now
azz: Xikontitani se nepolol axkan

source: File that bookmark
azz: Archivo tein neskayot marcador

source: Find memory leaks and make your application zippy.
azz: Xikonajsi ijkuak mopolua taelnamikilis uan xikonchiua maj semi ijsiujkatekiti moaplicación.

source: Fine-tune animations, alignment and padding.
azz: Xikonyektali taixkopimej tein moolinij, keniuj tepantokej tensa uan keniuj kiixpexontijkej.

source: Firefox, a different browser for different times. Browse free.
azz: Firefox, se tataman navegador itech tataman tonalmej. Xiontatekiujti Internet uan amo moneki tiontaxtauas.

source: Firefox Aurora automatically sends feedback to Mozilla.
azz: Firefox tein Aurora iselti san kititanilia Mozilla tanemililmej.

source: Firefox Beta automatically sends feedback to Mozilla.
azz: Firefox tein Beta iselti san kititanilia Mozilla tanemililmej.

source: Firefox Browser: Better bookmarks everywhere you go
azz: Navegador Firefox: kipia tein okachi kuali nexkayomej marcadores kampa yeski tionyouej

source: Firefox Browser: Fast, Easy Password Manager
azz: Navegador Firefox: tein ika se ijsiujka uan amo ouij kiixyekanas ichtakatajkuilolmej

source: Firefox Browser: Use less memory, get more speed
azz: Navegador Firefox: kikui amo okachi taelnamikilis, kipia okachi ijsiujkayot

source: Firefox Developer Edition automatically sends feedback to Mozilla.
azz: Firefox Developer Edition iselti uan nimantsin kipanoltilia taman Mozilla uan ijkón no uelis kipias.

source: Firefox doesn’t sell access to your personal information like other companies. From privacy tools to tracking protection, you’re in charge of who sees what.
azz: Firefox amo kinamaka maj kalakikan tein titechonseliltijtinemi kemej oksekin tekitiloyamej. Kemej neskayot, ika manamikmej tein ika tikonyekanas motajkuilolneskayouan uan maj tikyekpiakan maj amo akin kiita toni se kiitstinemi, tejuatsin tikonixtalia akoni kiita tensa.

source: Firefox features
azz: Inepaleuiluan Firefox

source: Firefox Features
azz: Inepaleuiluan Firefox

source: Firefox for Android
azz: Firefox tein tionuelis tikontatekiujtis ika Android

source: Firefox for iOS
azz: Firefox tein tionuelis tikontatekiujtis ika iOS

source: Firefox for mobile
azz: Firefox ika teposmej tein se uelis kiuikas
